html/effj/methods.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>方法</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="klose" />
<link rel="stylesheet" type="text/css" href="css/main.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="concurrency.html"> UP </a>
 |
 <a accesskey="H" href="effj.html"> HOME </a>
</div><div id="content">
<h1 class="title">方法</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">检查参数的有效性</a>
<ul>
<li><a href="#sec-1-1">public方法</a></li>
<li><a href="#sec-1-2">private方法</a></li>
<li><a href="#sec-1-3">总结</a></li>
</ul>
</li>
<li><a href="#sec-2">必要时进行保护性拷贝</a></li>
<li><a href="#sec-3">谨慎设计方法签名</a></li>
<li><a href="#sec-4">慎用重载</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">检查参数的有效性</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">public方法</h3>
<div class="outline-text-3" id="text-1-1">
<p>
使用适当的异常来标记参数无效，常用的异常有IllegalArgumentException, IndexOutOfBoundsException, NullException, ArithmeticException等，并在Javadoc中使用@throws指明这些异常
</p>

<div class="org-src-container">

<pre class="src src-java"><span style="color: #ffa07a;">/**</span>
<span style="color: #ffa07a;"> * Returns a BigInteger whose value is (this mod m). This method</span>
<span style="color: #ffa07a;"> * differs from the remainder method in that it always returns a</span>
<span style="color: #ffa07a;"> * non-negative BigInteger.</span>
<span style="color: #ffa07a;"> *</span>
<span style="color: #ffa07a;"> * </span><span style="color: #7fffd4;">@param</span><span style="color: #ffa07a;"> m the modulus, which must be positive</span>
<span style="color: #ffa07a;"> * </span><span style="color: #7fffd4;">@return</span><span style="color: #ffa07a;"> this mod m</span>
<span style="color: #ffa07a;"> * </span><span style="color: #7fffd4;">@throws</span><span style="color: #ffa07a;"> ArithmeticException if m is less than or equal to 0</span>
<span style="color: #ffa07a;"> */</span>
<span style="color: #00ffff;">public</span> <span style="color: #98fb98;">BigInteger</span> <span style="color: #87cefa;">mod</span>(<span style="color: #98fb98;">BigInteger</span> <span style="color: #eedd82;">m</span>) {
    <span style="color: #00ffff;">if</span> (m.signum() &lt;= 0)
        <span style="color: #00ffff;">throw</span> <span style="color: #00ffff;">new</span> <span style="color: #98fb98;">ArithmeticException</span>(<span style="color: #ffa07a;">"Modulus &lt;= 0: "</span> + m);
    <span style="color: #ff4500;">// </span><span style="color: #ff4500;">Do the computation</span>
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">private方法</h3>
<div class="outline-text-3" id="text-1-2">
<p>
使用断言来检查参数有效性，私有方法意味着调用者就是编写者。这种情况下可以控制传入的参数，只需要在开发的时候开启断言，在生产的时候关闭断言
</p>
<div class="org-src-container">

<pre class="src src-java"><span style="color: #ff4500;">// </span><span style="color: #ff4500;">Private helper function for a recursive sort</span>
<span style="color: #00ffff;">private</span> <span style="color: #00ffff;">static</span> <span style="color: #98fb98;">void</span> <span style="color: #87cefa;">sort</span>(<span style="color: #98fb98;">long</span> <span style="color: #eedd82;">a</span>[], <span style="color: #98fb98;">int</span> <span style="color: #eedd82;">offset</span>, <span style="color: #98fb98;">int</span> <span style="color: #eedd82;">length</span>) {
    <span style="color: #98fb98;">assert</span> <span style="color: #eedd82;">a</span> != <span style="color: #7fffd4;">null</span>;
    <span style="color: #98fb98;">assert</span> <span style="color: #eedd82;">offset</span> &gt;= 0 &amp;&amp; offset &lt;= a.length;
    <span style="color: #98fb98;">assert</span> <span style="color: #eedd82;">length</span> &gt;= 0 &amp;&amp; length &lt;= a.length - offset;
<span style="color: #ff4500;">// </span><span style="color: #ff4500;">Do the computation</span>
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3">总结</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>必须特别注意那些只是用来被保存的参数，比如构造器中的参数往往不会参与运算，一旦设置错误会导致以后难以追查的bug
</li>
<li>有些计算和方法会隐式的执行必要的有效性检查，这种抛出的异常往往需要异常转译
</li>
<li>并不一定参数校验越严厉越好，方法应该追求通用性
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">必要时进行保护性拷贝</h2>
<div class="outline-text-2" id="text-2">
<p>
总是假设客户端会尽可能地破坏类的约束条件，所以在编写类的时候要考虑防御性
</p>

<p>
粗看BrokenPeriod是一个不可变类
</p>
<div class="org-src-container">

<pre class="src src-java"><span style="color: #ff4500;">// </span><span style="color: #ff4500;">Broken "immutable" time period class</span>
<span style="color: #00ffff;">public</span> <span style="color: #00ffff;">class</span> <span style="color: #98fb98;">BrokenPeriod</span> {

    <span style="color: #00ffff;">private</span> <span style="color: #00ffff;">final</span> <span style="color: #98fb98;">Date</span> <span style="color: #eedd82;">start</span>;
    <span style="color: #00ffff;">private</span> <span style="color: #00ffff;">final</span> <span style="color: #98fb98;">Date</span> <span style="color: #eedd82;">end</span>;

    <span style="color: #ffa07a;">/**</span>
<span style="color: #ffa07a;">     * </span><span style="color: #7fffd4;">@param</span><span style="color: #ffa07a;"> start the beginning of the period</span>
<span style="color: #ffa07a;">     * </span><span style="color: #7fffd4;">@param</span><span style="color: #ffa07a;"> end the end of the period; must not precede start</span>
<span style="color: #ffa07a;">     * </span><span style="color: #7fffd4;">@throws</span><span style="color: #ffa07a;"> IllegalArgumentException if start is after end</span>
<span style="color: #ffa07a;">     * </span><span style="color: #7fffd4;">@throws</span><span style="color: #ffa07a;"> NullPointerException if start or end is null</span>
<span style="color: #ffa07a;">     */</span>
    <span style="color: #00ffff;">public</span> <span style="color: #87cefa;">BrokenPeriod</span>(<span style="color: #98fb98;">Date</span> <span style="color: #eedd82;">start</span>, <span style="color: #98fb98;">Date</span> <span style="color: #eedd82;">end</span>) {
        <span style="color: #00ffff;">if</span> (start.compareTo(end) &gt; 0) {
            <span style="color: #00ffff;">throw</span> <span style="color: #00ffff;">new</span> <span style="color: #98fb98;">IllegalArgumentException</span>(
                start + <span style="color: #ffa07a;">" after "</span> + end);
        }
        <span style="color: #00ffff;">this</span>.start = start;
        <span style="color: #00ffff;">this</span>.end = end;
    }

    <span style="color: #00ffff;">public</span> <span style="color: #98fb98;">Date</span> <span style="color: #87cefa;">start</span>() {
        <span style="color: #00ffff;">return</span> start;
    }

    <span style="color: #00ffff;">public</span> <span style="color: #98fb98;">Date</span> <span style="color: #87cefa;">end</span>() {
        <span style="color: #00ffff;">return</span> end;
    }
}
</pre>
</div>

<p>
对于BrokenPeriod来说不可变的只是start,end成员的引用，但是Date类是可变的，所以start,end内部的属性依旧是可变的
</p>
<div class="org-src-container">

<pre class="src src-java"><span style="color: #ff4500;">// </span><span style="color: #ff4500;">Attack the internals of a Period instance</span>
<span style="color: #98fb98;">Date</span> <span style="color: #eedd82;">start</span> = <span style="color: #00ffff;">new</span> <span style="color: #98fb98;">Date</span>();
<span style="color: #98fb98;">Date</span> <span style="color: #eedd82;">end</span> = <span style="color: #00ffff;">new</span> <span style="color: #98fb98;">Date</span>();
<span style="color: #98fb98;">BrokenPeriod</span> <span style="color: #eedd82;">p</span> = <span style="color: #00ffff;">new</span> <span style="color: #98fb98;">BrokenPeriod</span>(start, end);
System.out.println(p.end());

end.setYear(78); <span style="color: #ff4500;">// </span><span style="color: #ff4500;">Modifies internals of p!</span>
System.out.println(p.end());
</pre>
</div>

<p>
如果要保证类的可变性，请对构造器的参数使用防御性拷贝，并且拷贝必须在校验参数前。注意：保护性拷贝不要使用clone方法，因为clone可以返回一个成员的子类，而这个子类是否安全是未知的
</p>
<div class="org-src-container">

<pre class="src src-java"><span style="color: #ff4500;">// </span><span style="color: #ff4500;">Repaired constructor - makes defensive copies of parameters</span>
<span style="color: #00ffff;">public</span> <span style="color: #87cefa;">Period</span>(<span style="color: #98fb98;">Date</span> <span style="color: #eedd82;">start</span>, <span style="color: #98fb98;">Date</span> <span style="color: #eedd82;">end</span>) {
    <span style="color: #00ffff;">this</span>.start = <span style="color: #00ffff;">new</span> <span style="color: #98fb98;">Date</span>(start.getTime());
    <span style="color: #00ffff;">this</span>.end = <span style="color: #00ffff;">new</span> <span style="color: #98fb98;">Date</span>(end.getTime());
    <span style="color: #00ffff;">if</span> (<span style="color: #00ffff;">this</span>.start.compareTo(<span style="color: #00ffff;">this</span>.end) &gt; 0)
        <span style="color: #00ffff;">throw</span> <span style="color: #00ffff;">new</span> <span style="color: #98fb98;">IllegalArgumentException</span>(start +<span style="color: #ffa07a;">" after "</span>+ end);
}
</pre>
</div>

<p>
但是客户端依旧可以通过start(), end()方法获得成员的对象引用，这些对象内部状态依旧可以被改变
</p>
<div class="org-src-container">

<pre class="src src-java"><span style="color: #ff4500;">// </span><span style="color: #ff4500;">Second attack on the internals of a Period instance</span>
<span style="color: #98fb98;">Date</span> <span style="color: #eedd82;">start</span> = <span style="color: #00ffff;">new</span> <span style="color: #98fb98;">Date</span>();
<span style="color: #98fb98;">Date</span> <span style="color: #eedd82;">end</span> = <span style="color: #00ffff;">new</span> <span style="color: #98fb98;">Date</span>();
<span style="color: #98fb98;">Period</span> <span style="color: #eedd82;">p</span> = <span style="color: #00ffff;">new</span> <span style="color: #98fb98;">Period</span>(start, end);
p.end().setYear(78); <span style="color: #ff4500;">// </span><span style="color: #ff4500;">Modifies internals of p!</span>
</pre>
</div>

<p>
返回私有对象引用也必须是防御性拷贝
</p>
<div class="org-src-container">

<pre class="src src-java"><span style="color: #ff4500;">// </span><span style="color: #ff4500;">Repaired accessors - make defensive copies of internal fields</span>
<span style="color: #00ffff;">public</span> <span style="color: #98fb98;">Date</span> <span style="color: #87cefa;">start</span>() {
    <span style="color: #00ffff;">return</span> <span style="color: #00ffff;">new</span> <span style="color: #98fb98;">Date</span>(start.getTime());
}

<span style="color: #00ffff;">public</span> <span style="color: #98fb98;">Date</span> <span style="color: #87cefa;">end</span>() {
    <span style="color: #00ffff;">return</span> <span style="color: #00ffff;">new</span> <span style="color: #98fb98;">Date</span>(end.getTime());
}
</pre>
</div>

<p>
长度非零的数组总是可变的。把内部数组返回给客户端之前，应该总要进行保护性拷贝，或者给客户端返回该数组的不可变视图
</p>

<p>
保护性拷贝会引起性能问题，如果方法不暴露给客户端，可以考虑不需要进行保护性拷贝
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">谨慎设计方法签名</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>谨慎地选择方法的名称
</li>
<li>不要过于追求提供便利的方法,这回导致方法粒度太细
</li>
<li>避免过长的参数列表，同类型的长参数序列格外有害，分解成多个方法或创建辅助嵌套类
</li>
<li>对于参数类型，要优先使用接口而不是类
</li>
<li>避免boolean参数，要优先使用两个元素的枚举类型
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">慎用重载</h2>
<div class="outline-text-2" id="text-4">
<p>
覆盖是动态的，也就是在运行时候决定调用哪个子类的方法
</p>
<div class="org-src-container">

<pre class="src src-java"><span style="color: #00ffff;">public</span> <span style="color: #00ffff;">class</span> <span style="color: #98fb98;">Overriding</span> {
    <span style="color: #00ffff;">public</span> <span style="color: #00ffff;">static</span> <span style="color: #98fb98;">void</span> <span style="color: #87cefa;">main</span>(<span style="color: #98fb98;">String</span>[] <span style="color: #eedd82;">args</span>) {
        <span style="color: #98fb98;">Wine</span>[] <span style="color: #eedd82;">wines</span> = {
            <span style="color: #00ffff;">new</span> <span style="color: #98fb98;">Wine</span>(), <span style="color: #00ffff;">new</span> <span style="color: #98fb98;">SparklingWine</span>(), <span style="color: #00ffff;">new</span> <span style="color: #98fb98;">Champagne</span>()
        };
        <span style="color: #ff4500;">//</span><span style="color: #ff4500;">wine</span>
        <span style="color: #ff4500;">//</span><span style="color: #ff4500;">sparkling wine</span>
        <span style="color: #ff4500;">//</span><span style="color: #ff4500;">champagne</span>
        <span style="color: #00ffff;">for</span> (<span style="color: #98fb98;">Wine</span> <span style="color: #eedd82;">wine</span> : wines) {
            System.out.println(wine.name());
        }
    }
}

<span style="color: #00ffff;">class</span> <span style="color: #98fb98;">Wine</span> {
    <span style="color: #98fb98;">String</span> <span style="color: #87cefa;">name</span>() {
        <span style="color: #00ffff;">return</span> <span style="color: #ffa07a;">"wine"</span>;
    }
}

<span style="color: #00ffff;">class</span> <span style="color: #98fb98;">SparklingWine</span> <span style="color: #00ffff;">extends</span> <span style="color: #98fb98;">Wine</span> {
    <span style="color: #98fb98;">String</span> <span style="color: #87cefa;">name</span>() {
        <span style="color: #00ffff;">return</span> <span style="color: #ffa07a;">"sparkling wine"</span>;
    }
}

<span style="color: #00ffff;">class</span> <span style="color: #98fb98;">Champagne</span> <span style="color: #00ffff;">extends</span> <span style="color: #98fb98;">SparklingWine</span> {
    <span style="color: #98fb98;">String</span> <span style="color: #87cefa;">name</span>() {
        <span style="color: #00ffff;">return</span> <span style="color: #ffa07a;">"champagne"</span>;
    }
}
</pre>
</div>

<p>
但是重载是静态的，在编译的时候就决定了会调用哪个重载方法
</p>
<div class="org-src-container">

<pre class="src src-java"><span style="color: #ff4500;">// </span><span style="color: #ff4500;">Broken! - What does this program print?</span>
<span style="color: #00ffff;">public</span> <span style="color: #00ffff;">class</span> <span style="color: #98fb98;">BrokenCollectionClassifier</span> {

    <span style="color: #00ffff;">public</span> <span style="color: #00ffff;">static</span> <span style="color: #98fb98;">String</span> <span style="color: #87cefa;">classify</span>(<span style="color: #98fb98;">Set</span>&lt;?&gt; <span style="color: #eedd82;">s</span>) {
        <span style="color: #00ffff;">return</span> <span style="color: #ffa07a;">"Set"</span>;
    }

    <span style="color: #00ffff;">public</span> <span style="color: #00ffff;">static</span> <span style="color: #98fb98;">String</span> <span style="color: #87cefa;">classify</span>(<span style="color: #98fb98;">List</span>&lt;?&gt; <span style="color: #eedd82;">lst</span>) {
        <span style="color: #00ffff;">return</span> <span style="color: #ffa07a;">"List"</span>;
    }

    <span style="color: #00ffff;">public</span> <span style="color: #00ffff;">static</span> <span style="color: #98fb98;">String</span> <span style="color: #87cefa;">classify</span>(<span style="color: #98fb98;">Collection</span>&lt;?&gt; <span style="color: #eedd82;">c</span>) {
        <span style="color: #00ffff;">return</span> <span style="color: #ffa07a;">"Unknown Collection"</span>;
    }

    <span style="color: #00ffff;">public</span> <span style="color: #00ffff;">static</span> <span style="color: #98fb98;">void</span> <span style="color: #87cefa;">main</span>(<span style="color: #98fb98;">String</span>[] <span style="color: #eedd82;">args</span>) {
        <span style="color: #98fb98;">Collection</span>&lt;?&gt;[] <span style="color: #eedd82;">collections</span> = {
            <span style="color: #00ffff;">new</span> <span style="color: #98fb98;">HashSet</span>&lt;<span style="color: #98fb98;">String</span>&gt;(),
            <span style="color: #00ffff;">new</span> <span style="color: #98fb98;">ArrayList</span>&lt;<span style="color: #98fb98;">BigInteger</span>&gt;(),
            <span style="color: #00ffff;">new</span> <span style="color: #98fb98;">HashMap</span>&lt;<span style="color: #98fb98;">String</span>, <span style="color: #98fb98;">String</span>&gt;().values()
        };

        <span style="color: #ff4500;">//</span><span style="color: #ff4500;">Unknown Collection</span>
        <span style="color: #ff4500;">//</span><span style="color: #ff4500;">Unknown Collection</span>
        <span style="color: #ff4500;">//</span><span style="color: #ff4500;">Unknown Collection        </span>
        <span style="color: #00ffff;">for</span> (<span style="color: #98fb98;">Collection</span>&lt;?&gt; <span style="color: #eedd82;">c</span> : collections) {
            System.out.println(classify(c));
        }
    }
}
</pre>
</div>

<p>
只提供一个接受Collection&lt;?&gt;参数的方法，在方法内部使用instanceof判断
</p>
<div class="org-src-container">

<pre class="src src-java"><span style="color: #00ffff;">public</span> <span style="color: #00ffff;">static</span> <span style="color: #98fb98;">String</span> <span style="color: #87cefa;">classify</span>(<span style="color: #98fb98;">Collection</span>&lt;?&gt; <span style="color: #eedd82;">c</span>) {
    <span style="color: #00ffff;">return</span> c <span style="color: #00ffff;">instanceof</span> Set ? <span style="color: #ffa07a;">"Set"</span>
        : c <span style="color: #00ffff;">instanceof</span> List ? <span style="color: #ffa07a;">"List"</span> : <span style="color: #ffa07a;">"Unknown Collection"</span>;
}

<span style="color: #00ffff;">public</span> <span style="color: #00ffff;">static</span> <span style="color: #98fb98;">void</span> <span style="color: #87cefa;">main</span>(<span style="color: #98fb98;">String</span>[] <span style="color: #eedd82;">args</span>) {
    <span style="color: #98fb98;">Collection</span>&lt;?&gt;[] <span style="color: #eedd82;">collections</span> = {
        <span style="color: #00ffff;">new</span> <span style="color: #98fb98;">HashSet</span>&lt;<span style="color: #98fb98;">String</span>&gt;(),
        <span style="color: #00ffff;">new</span> <span style="color: #98fb98;">ArrayList</span>&lt;<span style="color: #98fb98;">BigInteger</span>&gt;(),
        <span style="color: #00ffff;">new</span> <span style="color: #98fb98;">HashMap</span>&lt;<span style="color: #98fb98;">String</span>, <span style="color: #98fb98;">String</span>&gt;().values()
    };

    <span style="color: #ff4500;">//</span><span style="color: #ff4500;">Set</span>
    <span style="color: #ff4500;">//</span><span style="color: #ff4500;">List</span>
    <span style="color: #ff4500;">//</span><span style="color: #ff4500;">Unknown Collection        </span>
    <span style="color: #00ffff;">for</span> (<span style="color: #98fb98;">Collection</span>&lt;?&gt; <span style="color: #eedd82;">c</span> : collections) {
        System.out.println(classify(c));
    }
}
</pre>
</div>

<p>
尽量避免提供两个参数数量相同的重载方法！ 
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: klose</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
